# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [22]:
import numpy as np
import pandas as pd

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [23]:
cars1 = pd.read_csv('cars1.csv')
cars2 = pd.read_csv('cars2.csv')

print(cars1.head().to_string())
print(cars2.head().to_string())

    mpg  cylinders  displacement horsepower  weight  acceleration  model  origin                        car  Unnamed: 9  Unnamed: 10  Unnamed: 11  Unnamed: 12  Unnamed: 13
0  18.0          8           307        130    3504          12.0     70       1  chevrolet chevelle malibu         NaN          NaN          NaN          NaN          NaN
1  15.0          8           350        165    3693          11.5     70       1          buick skylark 320         NaN          NaN          NaN          NaN          NaN
2  18.0          8           318        150    3436          11.0     70       1         plymouth satellite         NaN          NaN          NaN          NaN          NaN
3  16.0          8           304        150    3433          12.0     70       1              amc rebel sst         NaN          NaN          NaN          NaN          NaN
4  17.0          8           302        140    3449          10.5     70       1                ford torino         NaN          NaN          NaN          NaN          NaN
    mpg  cylinders  displacement horsepower  weight  acceleration  model  origin                 car
0  33.0          4            91         53    1795          17.4     76       3         honda civic
1  20.0          6           225        100    3651          17.7     76       1      dodge aspen se
2  18.0          6           250         78    3574          21.0     76       1   ford granada ghia
3  18.5          6           250        110    3645          16.2     76       1  pontiac ventura sj
4  17.5          6           258         95    3193          17.8     76       1       amc pacer d/l

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [24]:
cars1 = cars1.loc[:, 'mpg':'car']
# cars1.dropna(axis=1, inplace=True)
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [25]:
print(cars1.shape[0], cars2.shape[0])

198 200

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [29]:
cars = pd.concat([cars1, cars2], ignore_index=True)
# cars = cars1.append(cars2)
cars.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
393,27.0,4,140,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97,52,2130,24.6,82,2,vw pickup
395,32.0,4,135,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120,79,2625,18.6,82,1,ford ranger
397,31.0,4,119,82,2720,19.4,82,1,chevy s-10

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [36]:
nr_owners = np.random.randint(15000, high=73001, size=cars.shape[0], dtype='l')
nr_owners

array([68716, 71229, 58487, 39231, 39851, 30671, 59552, 57781, 16331,
       34891, 48032, 70649, 42627, 70905, 64171, 49293, 28082, 65892,
       71086, 38392, 33520, 49742, 36865, 66578, 18083, 49636, 57376,
       53126, 37953, 57464, 72189, 19741, 61398, 40159, 56427, 49629,
       51866, 40206, 49234, 47639, 60140, 29778, 60509, 72698, 40117,
       46540, 55027, 45657, 59686, 16602, 29853, 71484, 52104, 59272,
       69174, 36798, 60892, 35993, 45196, 56445, 36027, 30045, 29504,
       42011, 22957, 48313, 25866, 48497, 44033, 47166, 22571, 30717,
       71859, 47327, 41971, 69235, 19579, 44820, 41426, 60957, 45394,
       31008, 62612, 53998, 68506, 39500, 61694, 65847, 31461, 45279,
       41335, 70879, 17430, 26187, 24800, 29654, 45665, 71642, 53192,
       50337, 18068, 63934, 68895, 37902, 21144, 64274, 57353, 51030,
       25398, 47392, 33801, 70154, 25701, 58763, 66584, 39963, 60392,
       39141, 44336, 61443, 15857, 58769, 48524, 67294, 65681, 17819,
       68293, 60406, 29628, 58192, 43000, 39119, 57598, 63245, 37138,
       37518, 48259, 38561, 66450, 34828, 67709, 24904, 48430, 19028,
       55537, 49886, 48138, 45681, 50822, 22540, 48828, 42321, 67938,
       35430, 17966, 16083, 19163, 47405, 69709, 67617, 15888, 44959,
       33567, 32030, 70273, 40211, 59454, 30544, 32671, 31477, 27400,
       29942, 56785, 37024, 72760, 31798, 28488, 15733, 53459, 55464,
       46502, 66279, 63094, 33101, 28655, 54529, 25902, 46082, 44846,
       66215, 49214, 53394, 37258, 41253, 43981, 46377, 27648, 54430,
       51973, 19804, 45155, 46812, 48553, 61586, 38567, 31040, 54184,
       61358, 27755, 33488, 43386, 56914, 31526, 68343, 51207, 72291,
       32495, 62823, 19297, 57462, 26441, 53677, 30368, 51250, 27723,
       48239, 27474, 52333, 52027, 49327, 46095, 23493, 19535, 20902,
       23888, 63377, 44586, 35217, 18764, 48581, 46032, 70213, 55853,
       53054, 47865, 25760, 43685, 61623, 38937, 49419, 66724, 21925,
       56862, 37928, 59399, 62453, 62860, 40925, 58320, 20942, 30867,
       20100, 47759, 33791, 30528, 54115, 29893, 59256, 30473, 38388,
       22150, 72347, 23003, 66018, 51682, 59921, 55577, 60366, 66198,
       28888, 25373, 26457, 68867, 63542, 44141, 29889, 21729, 41988,
       38377, 55937, 18422, 34677, 23540, 26832, 19744, 45138, 51801,
       24810, 47946, 17914, 26809, 62552, 23938, 29388, 27889, 24651,
       34621, 60384, 27455, 26828, 55304, 50932, 53094, 33295, 67035,
       63188, 65707, 46742, 46227, 19909, 68665, 38748, 20640, 63019,
       19587, 59910, 32474, 21385, 27917, 35080, 59075, 21591, 72979,
       63050, 26555, 72275, 19637, 41250, 60530, 48338, 20374, 55693,
       46131, 55780, 20429, 23231, 69374, 53917, 33327, 23043, 29117,
       32310, 46028, 37172, 37636, 52533, 18071, 72611, 68619, 15419,
       29020, 16320, 49783, 61356, 68339, 49725, 28070, 54834, 27795,
       62024, 50801, 27526, 28428, 33632, 33257, 28261, 16335, 37236,
       69907, 44524, 40887, 52297, 64261, 26349, 22777, 44006, 25098,
       54280, 35029, 48969, 67557, 68567, 27183, 16198, 71260, 45427,
       42589, 18717])

### Step 8. Add the column owners to cars

In [37]:
cars['owners'] = nr_owners
cars.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
393,27.0,4,140,86,2790,15.6,82,1,ford mustang gl,16198
394,44.0,4,97,52,2130,24.6,82,2,vw pickup,71260
395,32.0,4,135,84,2295,11.6,82,1,dodge rampage,45427
396,28.0,4,120,79,2625,18.6,82,1,ford ranger,42589
397,31.0,4,119,82,2720,19.4,82,1,chevy s-10,18717